WcfHarness/WcfHarness/RequestXmls/DeleteApplication_HardDelete.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <DeleteApplication xmlns="http://www.tavisca.com/Vexiere/IApplication/2013/01">
      <deleteApplicationRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:ApplicationIdentifier i:type="a:IdBasedApplicationIdentifier">
          <a:Id>12</a:Id>
        </a:ApplicationIdentifier>
        <a:IsHardDelete>true</a:IsHardDelete>
      </deleteApplicationRequest>
    </DeleteApplication>
  </s:Body>
</s:Envelope>